package com.walking.lesson1_variables_data_types.task2;

// Вывести ваше имя посимвольно, где каждая буква — на новой строке, не используя System.out.println().
// Реализуется с использованием String.

public class ComplicatedWithString {
    public static void main(String[] args) {
        String name = "J\no\nh\nn";
        System.out.print(name);
    }
}
